app/Models/Profile/Mentoring.php

    public function getMentorsWithInfo(){
        return $this->select('mentoring.*,users.*, profile.*, contact.*,mentoring.id AS id,users.id AS userId, profile.id AS profileId, contact.id AS contactId')
        ->join('users', 'users.id = mentoring.userid')
        ->join('profile', 'profile.id = mentoring.profileid')
        ->join('contact', 'contact.id = mentoring.contactid')
        ->where('mentoring.status', 'pending') // Assuming there's a column indicating mentor status
        ->findAll();
---
SELECT `mentoring`.*, `users`.*, `profile`.*, `contact`.*, `mentoring`.`id` AS `id`, `users`.`id` AS `userId`, `profile`.`id` AS `profileId`, `contact`.`id` AS `contactId`
FROM `mentoring`
JOIN `users` ON `users`.`id` = `mentoring`.`userid`
JOIN `profile` ON `profile`.`id` = `mentoring`.`profileid`
JOIN `contact` ON `contact`.`id` = `mentoring`.`contactid`
WHERE `mentoring`.`status` = 'pending'