app/Controllers/Login/Auth.php

INSERT INTO `users` (`firstname`, `lastname`, `username`, `password`) VALUES ('clark', 'kent', 'superman123', '$2y$10$H/F8VO4VCJykAo10D4Nzre1npkTL3MI8xScfSZmgdsDBYHms3JCPa')
---

                ];

                $query = $userModel->insert($data);

SELECT *
FROM `users`
WHERE `username` = '202011'
 LIMIT 1
---
    public function check(){
        $validation = $this->validate([
            'username' => [
                'rules' => 'required|is_not_unique[users.username]',
                'errors' => ['required' => 'Username required',
                            'is_not_unique' => 'No Account exists'

                ],
            ],
            'password' => [
                'rules' => 'required|min_length[5]',
                'errors' => ['required' => 'Password required',
                            'min_length' => 'minimum of 5 characters',
                ],
            ],

        ]);

        if(!$validation){
            return view('loginView/login', ['validation'=>$this->validator]);
        } else{
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');
            $userModel = new userModel();

            $userInfo = $userModel->where('username', $username)->first();