app/Controllers/AdminController/Admin.php

    public function adminView(){
        $adminModel = new AdminModel();
        $userModel = new UserModel();
        $loggedUser = session()->get('loggedAdmin');
        $adminInfo = $adminModel->find($loggedUser);
        $userInfo = $userModel->findAll();
---
SELECT *
FROM `admin`
WHERE `admin`.`id` = '17'
SELECT *
FROM `users`

    public function superAdminView(){
        $adminModel = new AdminModel();
        $userModel = new UserModel();
        $loggedUser = session()->get('loggedAdmin');
        $adminInfo = $adminModel->find($loggedUser);
        $activeUser = $userModel->where('status','active')->findAll();
        $disabledUser = $userModel->where('status','disabled')->findAll();
        $data = [
            'title' => ' Super Admin',
            'adminInfo' => $adminInfo,
            'admin' => $adminModel->where('role','admin')->findAll(),
            'userInfo' => $activeUser,
            'disabled' =>  $disabledUser
        ];
---
SELECT *
FROM `admin`
WHERE `admin`.`id` = '9'
SELECT *
FROM `users`
WHERE `status` = 'active'
SELECT *
FROM `users`
WHERE `status` = 'disabled'
SELECT *
FROM `admin`
WHERE `role` = 'admin'

    public function addAdmin(){
        $adminModel = new AdminModel();
        $loggedUser = session()->get('loggedAdmin');
        $adminInfo = $adminModel->find($loggedUser);
---
SELECT *
FROM `admin`
WHERE `admin`.`id` = '22'

    public function editView($acc_num){
        $adminModel = new AdminModel();
        $accInfo = $adminModel->find($acc_num);
---
SELECT *
FROM `admin`
WHERE `admin`.`id` = '10'