app/Controllers/AdminController/JobController.php

SELECT *
FROM `tbl_jobs`
WHERE `Status` = 'active'
SELECT *
FROM `tbl_jobs`
WHERE `Status` = 'disabled'
---
    public function index()
    {

        $fetchJob = new JobModel();

        #$data['jobs'] =$fetchJob->findall();
        $data['jobs'] = $fetchJob->where('Status', 'active')->findall();
        $data['archi'] = $fetchJob->where('Status', 'disabled')->findall();