app/Controllers/AdminController/NewsController.php

    public function index()
    {

        $fetchNews = new NewsModel();
        $fetchEvents = new EventsModel();
        #$data['news'] = $fetchNews->findall();
        $data['news'] = $fetchNews->where('Status', 'active')->findall();
        $data['archi'] = $fetchNews->where('Status', 'disabled')->findall();

        $data['events'] = $fetchEvents->where('events_status', 'active')->findall();
        $data['events_archi'] = $fetchEvents->where('events_status', 'disabled')->findall();
---
SELECT *
FROM `tbl_news`
WHERE `Status` = 'active'
SELECT *
FROM `tbl_news`
WHERE `Status` = 'disabled'
SELECT *
FROM `tbl_events`
WHERE `events_status` = 'active'
SELECT *
FROM `tbl_events`
WHERE `events_status` = 'disabled'