app/Controllers/AdminController/SuperAdminController.php

    public function index()
    {
        $adminModel = new AdminModel();
        $userModel = new UserModel();
        $loggedAdminId = session()->get('loggedAdmin');
        $loggedAdmin = $adminModel->find($loggedAdminId);
        $activeUser = $userModel->where('status','active')->findAll();
        $disabledUser = $userModel->where('status','disabled')->findAll();
        $adminCondition = array('role' => 'admin','status' => 'active');
        $data = [
            'title' => ' Super Admin',
            'loggedUser' => $loggedAdmin,
            'admin' => $adminModel->where($adminCondition)->findAll(),
---
SELECT *
FROM `admin`
WHERE `admin`.`id` = '9'
SELECT *
FROM `users`
WHERE `status` = 'active'
SELECT *
FROM `users`
WHERE `status` = 'disabled'
SELECT *
FROM `admin`
WHERE `role` = 'admin'
AND `status` = 'active'

    public function addAdmin(){
        $adminModel = new AdminModel();
        $userModel = new UserModel();
        $loggedAdminId = session()->get('loggedAdmin');
        $loggedAdmin = $adminModel->find($loggedAdminId);
        $activeUser = $userModel->where('status','active')->findAll();
        $disabledUser = $userModel->where('status','disabled')->findAll();
---
SELECT *
FROM `admin`
WHERE `admin`.`id` = '9'
SELECT *
FROM `users`
WHERE `status` = 'active'
SELECT *
FROM `users`
WHERE `status` = 'disabled'