app/Controllers/Dash/Dash.php

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    public function index()
    {   $userModel = new userModel();
        $loggedUser = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUser);

SELECT *
FROM `users`
WHERE `users`.`id` = 1
SELECT *
FROM `contact`
WHERE `userId` = 1
 LIMIT 1
SELECT *
FROM `education`
WHERE `userId` = 1
AND `status` = 'active'
SELECT *
FROM `profile`
WHERE `userId` = 1
 LIMIT 1
SELECT *
FROM `skills`
WHERE `skills`.`id` = 1
---
    public function profile(){
        $contactModel = new Contact();               //************************************ */
        $educationModel = new Education();
        $expModel = new Exp();                         //for profile
        $profileModel = new Profile();
        $skillsModel = new Skills();                //************************************ */
        $userModel = new userModel();

        $loggedUser = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUser);

        $contact = $contactModel->where('userId',$loggedUser)->first();
        $education = $educationModel->where(array('userId'=> $loggedUser,'status' => 'active'))->findAll();
        $exp = $expModel->where(array('userId'=> $loggedUser,'status' => 'active'))->findAll();
        $profile = $profileModel->where('userId',$loggedUser)->first();
        $skills = $skillsModel->find($loggedUser);

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function contact(){
        $profileModel = new Profile();
        $contactModel = new Contact();
        $userModel = new userModel();


        $loggedUser = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUser);

SELECT *
FROM `users`
WHERE `users`.`id` = 1
---
    public function addExp(){
        $userModel = new userModel();
        $loggedUser = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUser);