app/Controllers/Dash/MentoringController.php

    public function index()
    {
        $contactModel = new Contact();
        $profileModel = new Profile();
        $userModel = new userModel();
        $mentorModel = new Mentoring();

        $loggedUser = session()->get('loggedUser');
        $userData = $userModel->find($loggedUser);
        $contactData = $contactModel->where('userId',$loggedUser)->first();
        $profileData = $profileModel->where('userId',$loggedUser)->first();
        $mentorData = $mentorModel->where('status','active')->findAll();
        $mentorProfile = $mentorModel->where('userId',$loggedUser)->first();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '3'
SELECT *
FROM `mentoring`
WHERE `userId` = '3'
 LIMIT 1